svi_num = {
    1: "Зябирова Алина, Маслов Михаил, Усачёва Мария, Храповицкий Даниил + альпаков🦙",
    2: "Галеев Абдерашид, Зенович Артем, Мещерская Елизавета, Севастьянов Юрий, Шукшина Ирина",
    3: "Казаков Никита, Плещиков Димитрий, Захаров Тимофей, Чулков Руслан",
    4: "Гридинарь Николай, Кузьмук Павел, Тарасов Денис, Трутнев Севастьян"
}

svi_people = {
    "Храповицкий": 1, "Усачёва": 1, "Маслов": 1, "Зябирова": 1,
    "Тимофеев": 3, "Чулков": 3, "Лещиков": 3, "Казаков": 3,
    "Галеев": 2, "Лайтов": 2, "Шукшина": 2, "Зенович": 2, "Мещерская": 2,
    "Трутнев": 4, "Кузьмук": 4, "Измаилова": 4, "Коперник": 4
}